Revit 2024 API
RebarHandlesData Class
 This class is used to contain the information about the rebar handles defined by an external application.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class RebarHandlesData : IDisposable
Visual Basic
Public Class RebarHandlesData _
	Implements IDisposable
Visual C++
public ref class RebarHandlesData : IDisposable
Remarks
 All handle tags (custom, start, end) should have different values.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarHandlesData
See Also
RebarHandlesData Members
Autodesk.Revit.DB.Structure Namespace